[
    {
        "id": 1,
        "titre": "BEAST",
        "synopsis": "Nate Daniels, revient en Afrique du Sud, où il a autrefois rencontré sa femme aujourd’hui décédée, pour y passer des vacances prévues de longue date avec ses deux filles dans une réserve naturelle, tenue par Martin Battles, un vieil ami de la famille, biologiste spécialiste de la vie sauvage. Mais ce repos salvateur va se transformer en épreuve de survie quand un lion assoiffé de vengeance, unique rescapé de la traque sanguinaire d’ignobles braconniers, se met à dévorer tout humain sur sa route et prend en chasse le docteur et sa famille.",
        "genre": "Thriller, Horreur",
        "annee_de_production": "2022",
        "date_de_sortie": "06/08/2022",
        "duree": "1h 33min",
        "cinemas": [
            {
                "id": 1,
                "nom": "Pathé Dakar",
                "salle": 3,
                "nbreplace": 148,
                "prix": 4000,
                "horaire": {
                    "jour": "18/01/2023",
                    "temps": "19h 30 - 21h 3"
                }
            },
            {
                "id": 2,
                "nom": "Canal Olympia",
                "salle": 1,
                "nbreplace": 200,
                "prix": 4500,
                "horaire": {
                    "jour": "20/01/2023",
                    "temps": "22h 00 - 23h 33"
                }
            },
            {
                "id_cine": 3,
                "nom": "Cinema du Cea PLAZA",
                "salle": 3,
                "nbreplace": 350,
                "prix": 4000,
                "horaire": {
                    "jour": "23/02/2023",
                    "temps": "22h 15 - 23h 48"
                }
            }
        ]
    },
    {
        "id": 2,
        "titre": "BUZZ L'ÉCLAIR",
        "synopsis": "Après s’être échoué avec sa commandante et son équipage sur une planète hostile située à 4,2 millions d’années-lumière de la Terre, Buzz l’Eclair tente de ramener tout ce petit monde sain et sauf à la maison. Pour cela, il peut compter sur le soutien d’un groupe de jeunes recrues ambitieuses et sur son adorable chat robot, Sox. Mais l’arrivée du terrible Zurg et de son armée de robots impitoyables ne va pas leur faciliter la tâche, d’autant que ce dernier a un plan bien précis en tête.",
        "genre": "Aventure",
        "annee_de_production": "2022",
        "date_de_sortie": "17/06/2022 ",
        "duree": "1h 49min",
        "cinemas": [
            {
                "id": 1,
                "nom": "Institut Français",
                "salle": 4,
                "nbreplace": 200,
                "prix": 4500,
                "horaire": {
                    "jour": "30/03/2023",
                    "temps": "15h 45 - 17h 34"
                }
            },
            {
                "id_cine": 2,
                "nom": "Canal Olympia",
                "salle": 5,
                "nbreplace": 350,
                "prix": 4000,
                "horaire": {
                    "jour": "22/02/2023",
                    "temps": "22h 15 - 00h 04"
                }
            }
        ]
    },
    {
        "id": 3,
        "titre": "THE GRAY MAN",
        "synopsis": "The Gray Man est le nom de code de Court Gentry, un ancien agent de la CIA devenu tueur gages. S'il n'accepte d'éliminer que des individus qu'il considère comme des criminels, lui-même est la cible de toutes sortes d'organisations et groupes internationaux, notamment son ancien employeur.",
        "genre": "Action, Thriller",
        "annee_de_production": "2021",
        "date_de_sortie": "22/07/2022 ",
        "duree": "2h 02min",
        "cinemas": [
            {
                "id": 1,
                "nom": "Institut Français",
                "salle": 3,
                "nbreplace": 195,
                "prix": 7500,
                "horaire": {
                    "jour": "21/01/2023",
                    "temps": "22h 00 - 00h 02"
                }
            },
            {
                "id": 2,
                "nom": "Canal Olympia",
                "salle": 1,
                "nbreplace": 220,
                "prix": 12000,
                "horaire": {
                    "jour": "21/01/2023",
                    "temps": "23h 00 - 01h 02"
                }
            }
        ]
    },
    {
        "id": 4,
        "titre": "MAVERICK",
        "synopsis": "Après avoir été l’un des meilleurs pilotes de chasse de la Marine américaine pendant plus de trente ans, Pete Mitchell (Tom Cruise) continue à repousser ses limites en tant que pilote d'essai. Il refuse de monter en grade, car cela l’obligerait à renoncer à voler. Il est chargé de former un détachement de jeunes diplômés de l’école Top Gun pour une mission spéciale qu’aucun pilote n'aurait jamais imaginée. Lors de cette mission, Maverick rencontre le lieutenant Bradley “Rooster” Bradshaw (Miles Teller), le fils de son défunt ami, le navigateur Nick Bradshaw. Face à un avenir incertain, hanté par ses fantômes, Maverick va devoir affronter ses pires cauchemars au cours d’une mission qui exigera les plus grands sacrifices.",
        "genre": "Action, Drame",
        "annee_de_production": "2021",
        "date_de_sortie": "27/03/2022 ",
        "duree": "2h 11min",
        "cinemas": [
            {
                "id": 1,
                "nom": "Pathé Dakar",
                "salle": 2,
                "nbreplace": 260,
                "prix": 9000,
                "horaire": {
                    "jour": "19/01/2023",
                    "temps": "21h 10 - 23h 21"
                }
            }
        ]
    },
    {
        "id": 5,
        "titre": "COP SECRET",
        "synopsis": "Lorsque Bússi, le policier le plus coriace d'Islande, est contraint de travailler avec un nouveau partenaire pour résoudre une série de braquages de banques, la pression pour clore l'affaire le plus rapidement possible s'avère trop forte pour lui.",
        "genre": "Action",
        "annee_de_production": "2021",
        "date_de_sortie": "22/09/2021",
        "duree": "1h 38min",
        "cinemas": [
            {
                "id": 1,
                "nom": "Canal Olympia",
                "salle": 5,
                "nbreplace": 186,
                "prix": 5000,
                "horaire": {
                    "jour": "20/01/2023",
                    "temps": "23h 10 - 00h 48"
                }
            }
        ]
    }
]